Revit 2026 API

# IFCFile Class

---

Represents the IFC file which is being created during export.

SystemObject Autodesk.Revit.DB.IFCIFCFile

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCFile : IDisposable
```
```vb
Public Class IFCFile
	Implements IDisposable
```
```cpp
public ref class IFCFile : IDisposable
```
```fsharp
type IFCFile =
    class
        interface IDisposable
    end
```

The IFCFile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Close | Close the IFC file. |
|  | Create | Creates an IFC file for exporting. |
|  | CreateHeaderInstance | Creates an IFC header instance in the file model. |
|  | CreateInstance | Creates an IFC instance in the file model. |
|  | CreateStyle(ExporterIFC, IFCAnyHandle) | Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle, and assigns them to the file. |
|  | CreateStyle(ExporterIFC, IFCAnyHandle, Color, ElementId) | Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle, and assigns them to the file. |
|  | Dispose | Releases all resources used by the IFCFile |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetInstanceCount | Counts IFC instances of one particular type. |
|  | GetInstances | Gets IFC instances of one particular type. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Read(IFCFileReadOptions) | Reads content from a file of IFC format. |
|  | Read(IFCFileReadOptions, Int32, Int32) | Reads content from a file of IFC format. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | Write | Writes content to a file of IFC format. |

#### Reference

Autodesk.Revit.DB.IFC Namespace